# RebarShapeParameters Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeParameters Properties
RebarShapeParameters Class See Also
---
The RebarShapeParameters type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
RebarShapeParameters Class
Autodesk.Revit.DB.Structure Namespace